Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipni</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.this["telemetry:main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }
    }

  # github_issue_label.this["telemetry:bug"] will be created
  + resource "github_issue_label" "this" {
      + color       = "d73a4a"
      + description = "Something isn't working"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "bug"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:documentation"] will be created
  + resource "github_issue_label" "this" {
      + color       = "0075ca"
      + description = "Improvements or additions to documentation"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "documentation"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:duplicate"] will be created
  + resource "github_issue_label" "this" {
      + color       = "cfd3d7"
      + description = "This issue or pull request already exists"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "duplicate"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:enhancement"] will be created
  + resource "github_issue_label" "this" {
      + color       = "a2eeef"
      + description = "New feature or request"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "enhancement"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:good first issue"] will be created
  + resource "github_issue_label" "this" {
      + color       = "7057ff"
      + description = "Good for newcomers"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "good first issue"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:help wanted"] will be created
  + resource "github_issue_label" "this" {
      + color       = "008672"
      + description = "Extra attention is needed"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "help wanted"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:invalid"] will be created
  + resource "github_issue_label" "this" {
      + color       = "e4e669"
      + description = "This doesn't seem right"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "invalid"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:question"] will be created
  + resource "github_issue_label" "this" {
      + color       = "d876e3"
      + description = "Further information is requested"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "question"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_issue_label.this["telemetry:wontfix"] will be created
  + resource "github_issue_label" "this" {
      + color       = "ffffff"
      + description = "This will not be worked on"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "wontfix"
      + repository  = "telemetry"
      + url         = (known after apply)
    }

  # github_repository.this["telemetry"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = false
      + archived                    = false
      + auto_init                   = false
      + default_branch              = "main"
      + delete_branch_on_merge      = true
      + description                 = "measure indexer and provider metrics"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_discussions             = false
      + has_downloads               = true
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "telemetry"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true

      + security_and_analysis {

          + secret_scanning {
              + status = "enabled"
            }

          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_team_repository.this["admin:telemetry"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "telemetry"
      + team_id    = "7006912"
    }

  # github_team_repository.this["ci:telemetry"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "telemetry"
      + team_id    = "7006911"
    }

  # github_team_repository.this["contributors:telemetry"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "telemetry"
      + team_id    = "7006913"
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->